<?php
/* задание1
$a=3;
$a1=$a;
echo a1;*/
/*задание2
$a=10;
$b=2;
echo $a-$b . '</br>';
echo $a+$b . '</br>';
echo $a*$b . '</br>';
echo $a/$b;*/
/*задание3
$c=15;
$d=2;
$result=$c+$d;
echo $result;*/
/*задание4
$a=10;
$c=15;
$d=2;
echo ($a+$b+$c);
*/
/*задание5
$a=17;
$b=10;
$c=$a-$b;
$d=17;
$result=$c+$d;
echo $result;*/
/*работа со строками*/
/*задание1
$text='Привет мир';
echo $text, ' Моя первая пограмма';*/
/*задание2
$text='Привет';
$text2=' мир';
echo $text . $text2;*/
/*задание3
$name='Римма';
$text='новый текст';
echo 'привет  ' . $name .'!' . '</br>';
echo $text;*/
/*задание4
$age=18;
$heigth=160;
echo 'Мой возраст:' . $age . '|' .' Мой рост:' . $heigth;*/
/*задание4
$text='abcde';
echo $text[0],$text[2],$text[4];*/
/*Работа с массивами*/
/*задание1
$arr=['a','b','c'];
var_dump($arr);
var_dump($arr[0]);
var_dump($arr[1]);
var_dump($arr[2]);*/
/*задание2
$arr=['a','b','c'];
echo $arr[0],$arr[1],$arr[2];*/
/*задание3
$arr=['a','b','c','d'];
echo  $arr[0] . '+' .  $arr[1] . ', ' . $arr[2]. '+' . $arr[3] . ', ' . $arr[0] . '-' . $arr[3] . ', ' . $arr[0] . '/' . $arr[3];*/
/*задание4
$arr=[2,5,3,9];
$result=$arr[0]*$arr[1]+$arr[2]*$arr[3];
echo $result;*/
/*задание5
$arr[]=[1,2,3,4,5];
var_dump($arr);*/
/*АССОЦИАТИВНЫЕ МАССИВЫ
*/
/*задание1
$arr=['a' =>11,'b' =>20,'c' =>30];
echo $arr['c'] . '</br>';
echo  $arr['c']+$arr['a']+$arr['b'];*/
/*задание2
$arr=['q3' =>12,'r3' =>23,'f3' =>34];
echo  array_sum($arr);*/
/*задание3
$arr = ['Коля'=>'1000$', 'Вася'=>'500$', 'Петя'=>'200$'];
echo 'Зарплата Коли:'. $arr['Коля'] . '; Зарплата Пети:'. $arr['Петя'];*/
/*задание4
$month=[1=>'Январь',2 =>'Февраль', 3=>'Март', 4=>'Апрель', 5=>'Май', 6=>'Июнь', 7=>'Июль', 8=>'Август', 9=>'Сентябрь', 10=>'Октябрь', 11=>'Ноябрь', 12=>'Декабрь',];
echo 'Первый месяу учебы: ' . $month[9] . '</br>' . 'Последний день учебы: ' . $month[6];*/
/*задание5*/
$day=[1=>'Понидельник',2 =>'Вторник', 3=>'Среда', 4=>'Четверг', 5=>'Пятница', 6=>'Суббота', 7=>'Воскресенье'];
echo $day[3];
